/*Random rand = new Random();
int num = rand.Next(10, 99);

int a = num / 10;
int b = num % 10;

int result = 0;

if(a > result) result = a;
else result = b;

Console.WriteLine("От числа " + result);
Console.WriteLine("Максимальная цифра в числе " + result);*/

//------------------

/*
Напишите программу, которая будет принимать на вход два числа и выводить, является ли второе число кратным первому. Если второе число не кратно числу первому, то программа выводит остаток от деления.

int x = Convert.ToInt32(Console.ReadLine());
int y = 7;
int n = 23;
if(x % y == 0 && x % n == 0) Console.WriteLine("Кратно");
else Console.WriteLine("Не кратно");*/

Console.WriteLine("Вводим первое число");
int a = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Вводим второе число");
int b = Convert.ToInt32(Console.ReadLine());

